namespace 下載券點;

public class c券點 {
  public static Dictionary<string, string> Get_dic券商() {
    var dic = new Dictionary<string, string> {
        // 2023-10-26日查，共 84 家
        { "1020", "合庫" },
        { "1030", "土銀" },
        { "1040", "臺銀" },
        { "1090", "台灣工銀" },
        { "1110", "台灣企銀" },
        { "1160", "日盛" }, // 2023y己無
        { "1230", "彰銀" },
        { "1260", "宏遠" },

        { "1360", "港商麥格理" }, // 外資
        { "1380", "台灣匯立證券" }, // 外資

        { "1400", "港商蘇皇" }, // 外資 --> (2013y停)
        { "1440", "美林" }, // 外資
        { "1470", "台灣摩根士丹利" }, // 外資
        { "1480", "美商高盛" }, // 外資

        { "1520", "瑞士信貸" }, // 外資
        { "1530", "港商德意志(停)" }, // 外資 --> (2020y停)
        { "1560", "港商野村" }, // 外資
        { "1570", "港商法國興業" }, // 外資
        { "1590", "花旗環球" }, // 外資

        { "1650", "新加坡商瑞銀" }, // 外資
        { "1660", "港商聯昌" }, // 外資 --> (2017y停)

        { "2180", "亞東" },
        { "2200", "元大期貨" },
        { "2210", "群益期貨" },

        { "3000", "台新銀" },

        { "5050", "大展" },
        { "5110", "富隆" }, // 2023y己無
        { "5260", "美好" }, // 原：大慶
        { "5320", "高橋" },
        { "5380", "第一金" },
        { "5460", "寶盛" },
        { "5500", "豐銀" },
        { "5600", "永興" },
        { "5660", "日進" },
        { "5690", "豐興" },
        { "5850", "統一" },
        { "5860", "盈溢" },
        { "5870", "光隆" }, // 2023y己無
        { "5920", "元富" },
        { "5960", "日茂" },

        { "6010", "(牛牛牛)亞證券" },
        { "6110", "台中銀" },
        { "6160", "中國信託" },
        { "6210", "新百王" },
        { "6380", "光和" },
        { "6450", "永全" },
        { "6460", "大昌" },
        { "6480", "福邦" },
        { "6620", "口袋證券" }, // 原：全泰
        { "6640", "渣打商銀" },
        { "6660", "和興" },
        { "6910", "德信" },
        { "6950", "福勝" },

        { "7000", "兆豐" },
        { "7030", "致和" },
        { "7070", "豐農" }, // 2023y己無
        { "7080", "石橋" },
        { "7120", "台安" },
        { "7530", "富順" },
        { "7690", "金興" },
        { "7750", "北城" },
        { "7790", "國票" },
        { "7900", "豐德" },

        { "8150", "台新" },
        { "8380", "安泰" },
        { "8440", "摩根大通" }, // 外資
        { "8450", "康和" },
        { "8490", "京城" }, // 原：萬泰
        { "8520", "中農" },
        { "8560", "新光" },
        { "8580", "聯邦商銀" },
        { "8660", "萬通(停)" },
        { "8690", "新壽" },
        { "8700", "花旗" }, // 外資 --> (2014y停)
        { "8710", "陽信" },
        { "8770", "大鼎" }, // (停)
        { "8840", "玉山" },
        { "8880", "國泰" },
        { "8890", "大和國泰" }, // 外資(日)
        { "8900", "法銀巴黎" }, // 外資
        { "8910", "台灣巴克萊" }, // 外資 --> (2016y停)
        { "8960", "香港上海匯豐" }, // 外資

        { "9100", "群益金鼎" },
        { "9200", "凱基" },
        { "9300", "華南永昌" },
        { "9600", "富邦" },
        { "9800", "元大" },
        { "9A00", "永豐金" }
    };
    return dic;
  }

  public static Dictionary<string, string> Get_dic分點(string s券商) {
    var dic = new Dictionary<string, string>();

    switch (s券商) {
    case "6010": // 犇亞證券
      dic.Add("6010", "(牛牛牛)亞證券");
      dic.Add("6012", "(牛牛牛)亞-網路");
      dic.Add("0036003000310064", "(牛牛牛)亞-鑫豐");
      break;

    case "1030": // 土銀
      dic.Add("0031003000330043", "土銀-白河");
      dic.Add("0031003000330046", "土銀-南港");
      dic.Add("0031003000330041", "土銀-建國");
      dic.Add("0031003000330042", "土銀-彰化");
      dic.Add("1031", "土銀-台中");
      dic.Add("1032", "土銀-台南");
      dic.Add("1033", "土銀-高雄");
      dic.Add("1034", "土銀-嘉義");
      dic.Add("1035", "土銀-新竹");
      dic.Add("1036", "土銀-玉里");
      dic.Add("1037", "土銀-花蓮");
      dic.Add("1038", "土銀-和平");
      dic.Add("1039", "土銀-士林");
      dic.Add("1030", "土銀");  // 總公司放後面
      break;

    case "6460": // 大昌
      dic.Add("6462", "大昌-安康");
      dic.Add("6465", "大昌-桃園");
      dic.Add("6463", "大昌-新竹");
      dic.Add("6464", "大昌-新店");
      dic.Add("6461", "大昌-樹林");
      dic.Add("6460", "大昌");
      break;

    case "5050": // 大展
      dic.Add("5058", "大展-台南");
      dic.Add("5050", "大展");
      break;

    case "5260": // 美好 (原：大慶)
      dic.Add("0035003200360041", "美好-中和");
      dic.Add("003500320036004d", "美好-市政");
      dic.Add("003500320036004c", "美好-長榮(停)");
      dic.Add("003500320036004b", "美好-富順");
      dic.Add("5261", "美好-蘆洲");
      dic.Add("5262", "美好-楊梅");
      dic.Add("5263", "美好-泰山");
      dic.Add("5264", "美好-高雄");
      dic.Add("5265", "美好-苗栗");
      dic.Add("5266", "美好-中壢");
      dic.Add("5267", "美好-基隆");
      dic.Add("5268", "美好-台南");
      dic.Add("5269", "美好-台中");
      dic.Add("5260", "美好");
      break;

    case "6160": // 中國信託
      dic.Add("0036003100360041", "中國信託-中壢");
      dic.Add("003600310036004b", "中國信託-高雄");
      dic.Add("0036003100360058", "中國信託-國際證券");
      dic.Add("6161", "中國信託-三重");
      dic.Add("6162", "中國信託-忠孝");
      dic.Add("6163", "中國信託-永康");
      dic.Add("6164", "中國信託-文心");
      dic.Add("6165", "中國信託-新竹");
      dic.Add("6167", "中國信託-松江");
      dic.Add("6168", "中國信託-嘉義");
      dic.Add("6169", "中國信託-雙和(停)");
      dic.Add("6160", "中國信託");
      break;

    case "9800": // 元大證券
      dic.Add("0039003800330057", "元大-大里德芳");
      dic.Add("0039003800390042", "元大-台中中港");
      dic.Add("0039003800320046", "元大-忠孝鼎富");
      dic.Add("0039003800310068", "元大-屏東民生");
      dic.Add("003900380039007a", "元大-國際證券");
      dic.Add("003900380036004b", "元大-基隆孝二");
      dic.Add("0039003800340043", "元大-新店中正");
      dic.Add("0039003800370044", "元大-新壢(停)");
      dic.Add("003900380039004a", "元大-彰化民生");
      dic.Add("0039003800390057", "元大-豐原站前");
      dic.Add("0039003800340045", "元大-南勢角");
      dic.Add("0039003800390056", "元大-北三重");
      dic.Add("0039003800330047", "元大-上新莊");
      dic.Add("0039003800380043", "元大-三重");
      dic.Add("003900380031006a", "元大-士林");
      dic.Add("0039003800390055", "元大-大甲");
      dic.Add("0039003800390047", "元大-大同");
      dic.Add("003900380033004e", "元大-大安");
      dic.Add("0039003800310067", "元大-大里");
      dic.Add("003900380031007a", "元大-大統");
      dic.Add("0039003800330069", "元大-大雅");
      dic.Add("003900380039005a", "元大-小港");
      dic.Add("0039003800390065", "元大-中和");
      dic.Add("003900380033006a", "元大-仁愛");
      dic.Add("003900380039004e", "元大-內湖");
      dic.Add("0039003800320043", "元大-六合");
      dic.Add("0039003800310049", "元大-天母");
      dic.Add("0039003800310051", "元大-太平");
      dic.Add("0039003800300043", "元大-斗六");
      dic.Add("003900380033004d", "元大-木柵");
      dic.Add("0039003800390064", "元大-北屯");
      dic.Add("0039003800390041", "元大-北投");
      dic.Add("003900380039006b", "元大-古亭");
      dic.Add("0039003800300068", "元大-台北");
      dic.Add("0039003800390044", "元大-左營");
      dic.Add("0039003800390058", "元大-民生");
      dic.Add("0039003800310056", "元大-民雄");
      dic.Add("003900380039004c", "元大-成功");
      dic.Add("0039003800390051", "元大-汐止");
      dic.Add("0039003800310052", "元大-竹山");
      dic.Add("0039003800310042", "元大-竹北");
      dic.Add("0039003800330066", "元大-竹東");
      dic.Add("0039003800330056", "元大-竹南");
      dic.Add("003900380030004b", "元大-竹科");
      dic.Add("0039003800300077", "元大-西屯");
      dic.Add("0039003800310069", "元大-西螺");
      dic.Add("0039003800300064", "元大-沙鹿");
      dic.Add("0039003800310065", "元大-佳里");
      dic.Add("0039003800300075", "元大-府城");
      dic.Add("0039003800300061", "元大-承德");
      dic.Add("0039003800310058", "元大-新生");
      dic.Add("0039003800390066", "元大-東港");
      dic.Add("0039003800330042", "元大-林森");
      dic.Add("003900380031004b", "元大-林園");
      dic.Add("0039003800390043", "元大-板橋");
      dic.Add("0039003800310070", "元大-松山");
      dic.Add("003900380030006c", "元大-虎尾");
      dic.Add("003900380031004e", "元大-金門");
      dic.Add("0039003800380056", "元大-長庚");
      dic.Add("003900380039006d", "元大-信義");
      dic.Add("003900380031006d", "元大-前金");
      dic.Add("0039003800310044", "元大-南投");
      dic.Add("0039003800300051", "元大-南崁");
      dic.Add("0039003800300052", "元大-南海");
      dic.Add("0039003800310072", "元大-屏南");
      dic.Add("003900380031004d", "元大-苗栗");
      dic.Add("0039003800390061", "元大-苑裡");
      dic.Add("0039003800380042", "元大-桃園");
      dic.Add("0039003800390045", "元大-草屯");
      dic.Add("0039003800390046", "元大-高雄");
      dic.Add("0039003800390059", "元大-基隆");
      dic.Add("0039003800310053", "元大-崇德");
      dic.Add("0039003800300065", "元大-清水");
      dic.Add("003900380031004c", "元大-莒光");
      dic.Add("0039003800390053", "元大-鹿港");
      dic.Add("0039003800320042", "元大-博愛");
      dic.Add("0039003800390050", "元大-敦南");
      dic.Add("0039003800340048", "元大-景美");
      dic.Add("0039003800310045", "元大-發財");
      dic.Add("0039003800310079", "元大-善化");
      dic.Add("0039003800310055", "元大-華山");
      dic.Add("0039003800300044", "元大-北府");
      dic.Add("0039003800370041", "元大-楊梅");
      dic.Add("0039003800310071", "元大-萬華");
      dic.Add("0039003800310043", "元大-路竹");
      dic.Add("0039003800390067", "元大-嘉義");
      dic.Add("0039003800310047", "元大-彰化");
      dic.Add("003900380031006e", "元大-旗山");
      dic.Add("0039003800310046", "元大-福營");
      dic.Add("003900380033005a", "元大-鳳山");
      dic.Add("0039003800350043", "元大-鳳中");
      dic.Add("003900380031005a", "元大-潮州");
      dic.Add("003900380033004b", "元大-學甲");
      dic.Add("003900380039006a", "元大-樹林");
      dic.Add("0039003800330055", "元大-頭份");
      dic.Add("003900380034004b", "元大-館前");
      dic.Add("0039003800310061", "元大-歸仁");
      dic.Add("0039003800350046", "元大-岡山");
      dic.Add("0039003800320041", "元大-羅東");
      dic.Add("0039003800390049", "元大-蘆洲");
      dic.Add("0039003800310041", "元大-鶯歌");

      dic.Add("9800", "元大證券");
      dic.Add("9801", "元大-城東");
      dic.Add("9812", "元大-台中");
      dic.Add("9813", "元大-八德");
      dic.Add("9814", "元大-大益");
      dic.Add("9815", "元大-大灣");
      dic.Add("9817", "元大-東泰");
      dic.Add("9819", "元大-桃園(停)");
      dic.Add("9822", "元大-土城學府");
      dic.Add("9824", "元大-向上");
      dic.Add("9825", "元大-新營");
      dic.Add("9829", "元大-永康");
      dic.Add("9831", "元大-四維");
      dic.Add("9833", "元大-敦化");
      dic.Add("9834", "元大-中壢");
      dic.Add("9835", "元大-員林中山");
      dic.Add("9837", "元大-北港");
      dic.Add("9838", "元大-豐原");
      dic.Add("9846", "元大-大直");
      dic.Add("9852", "元大-永春");
      dic.Add("9853", "元大-南屯");
      dic.Add("9854", "元大-文心興安");
      dic.Add("9856", "元大-花蓮");
      dic.Add("9857", "元大-東蘆");
      dic.Add("9858", "元大-龍潭");
      dic.Add("9859", "元大-新竹經國");
      dic.Add("9816", "元大-新竹");
      dic.Add("9862", "元大-南京");
      dic.Add("9863", "元大-和平");
      dic.Add("9866", "元大-樹板(停)");
      dic.Add("9867", "元大-北成功");
      dic.Add("9868", "元大-文心");
      dic.Add("9869", "元大-新盛");
      dic.Add("9871", "元大-忠孝");
      dic.Add("9872", "元大-復北");
      dic.Add("9873", "元大-西門");
      dic.Add("9874", "元大-雙和");
      dic.Add("9875", "元大-土城永寧");
      dic.Add("9878", "元大-金華");
      dic.Add("9879", "元大-板橋三民");
      dic.Add("9884", "元大-斗信");
      dic.Add("9887", "元大-經紀部");
      dic.Add("9888", "元大-鑫永和");
      dic.Add("9889", "元大-員林");
      dic.Add("9891", "元大-永和");
      dic.Add("9892", "元大-屏東");
      dic.Add("9893", "元大-大天母");
      dic.Add("9894", "元大-桃興");
      dic.Add("9896", "元大-台南");
      dic.Add("9897", "元大-土城");
      dic.Add("9898", "元大-新莊");
      dic.Add("9899", "元大-淡水");
      break;

    case "5920": // 元富
      dic.Add("0035003900320044", "元富-大昌");
      dic.Add("003500390032006c", "元富-大裕");
      dic.Add("0035003900320067", "元富-中原");
      dic.Add("0035003900320069", "元富-中港");
      dic.Add("003500390032004c", "元富-中壢");
      dic.Add("003500390032007a", "元富-文心");
      dic.Add("0035003900320075", "元富-世貿");
      dic.Add("0035003900320065", "元富-古亭");
      dic.Add("0035003900320056", "元富-民權");
      dic.Add("0035003900320042", "元富-永和");
      dic.Add("0035003900320057", "元富-吉利");
      dic.Add("0035003900320050", "元富-同大");
      dic.Add("003500390032005a", "元富-安南");
      dic.Add("003500390032006d", "元富-成功");
      dic.Add("003500390032006e", "元富-西松");
      dic.Add("0035003900320077", "元富-佳里");
      dic.Add("0035003900320055", "元富-宜蘭");
      dic.Add("0035003900320064", "元富-延平");
      dic.Add("0035003900320062", "元富-板橋");
      dic.Add("0035003900320061", "元富-松德");
      dic.Add("0035003900320079", "元富-花蓮");
      dic.Add("003500390032004e", "元富-虎尾");
      dic.Add("0035003900320048", "元富-信義");
      dic.Add("0035003900320045", "元富-城中");
      dic.Add("0035003900320072", "元富-城東");
      dic.Add("0035003900320071", "元富-屏東");
      dic.Add("0035003900320059", "元富-埔里");
      dic.Add("0035003900320076", "元富-桃園");
      dic.Add("0035003900320063", "元富-烏日");
      dic.Add("0035003900320058", "元富-草屯");
      dic.Add("0035003900320066", "元富-國際證券");
      dic.Add("0035003900320053", "元富-基隆");
      dic.Add("0035003900320051", "元富-敦南");
      dic.Add("0035003900320047", "元富-新竹");
      dic.Add("003500390032006f", "元富-新興");
      dic.Add("0035003900320049", "元富-嘉義");
      dic.Add("003500390032004d", "元富-彰化");
      dic.Add("0035003900320043", "元富-潮州");
      dic.Add("0035003900320041", "元富-緯城");
      dic.Add("5921", "元富-高雄");
      dic.Add("5922", "元富-新店");
      dic.Add("5923", "元富-三重");
      dic.Add("5925", "元富-台中");
      dic.Add("5926", "元富-四維");
      dic.Add("5927", "元富-林園");
      dic.Add("5929", "元富-台南");
      dic.Add("5928", "元富-新莊");
      dic.Add("5920", "元富");
      break;

    case "5960": // 日茂
      dic.Add("5961", "日茂-埔里");
      dic.Add("5962", "日茂-南投");
      dic.Add("5964", "日茂-霧峰(停)");
      dic.Add("5960", "日茂");
      break;

    case "1160":// 日盛證券
      dic.Add("1160", "日盛證券");
      dic.Add("1161", "日盛-忠孝");
      dic.Add("1162", "日盛-台南");
      dic.Add("1163", "日盛-台中");
      dic.Add("1164", "日盛-內湖");
      dic.Add("1165", "日盛-板橋");
      dic.Add("1166", "日盛-雙和");
      dic.Add("1167", "日盛-嘉義");
      dic.Add("1168", "日盛-高雄");
      dic.Add("1169", "日盛-士林");
      dic.Add("0031003100360078", "日盛-國際證券");
      dic.Add("003100310036004a", "日盛-板橋中山");
      dic.Add("003100310036006b", "日盛-北高雄");
      dic.Add("0031003100360051", "日盛-二林");
      dic.Add("0031003100360043", "日盛-八德");
      dic.Add("0031003100360045", "日盛-三重");
      dic.Add("0031003100360064", "日盛-三峽");
      dic.Add("0031003100360073", "日盛-土城");
      dic.Add("003100310036004c", "日盛-大墩");
      dic.Add("003100310036005a", "日盛-中和");
      dic.Add("0031003100360042", "日盛-中壢");
      dic.Add("0031003100360072", "日盛-文化");
      dic.Add("0031003100360056", "日盛-斗六");
      dic.Add("0031003100360041", "日盛-木柵");
      dic.Add("003100310036004e", "日盛-永康");
      dic.Add("0031003100360065", "日盛-竹北");
      dic.Add("003100310036006d", "日盛-和美");
      dic.Add("0031003100360058", "日盛-宜蘭");
      dic.Add("003100310036004b", "日盛-花蓮");
      dic.Add("0031003100360050", "日盛-信義");
      dic.Add("0031003100360049", "日盛-南京");
      dic.Add("003100310036004d", "日盛-屏東");
      dic.Add("0031003100360046", "日盛-員林");
      dic.Add("0031003100360055", "日盛-桃園");

      dic.Add("0031003100360066", "日盛-復興");
      dic.Add("0031003100360047", "日盛-景美");
      dic.Add("0031003100360062", "日盛-園區");
      dic.Add("0031003100360048", "日盛-新竹");
      dic.Add("0031003100360053", "日盛-新莊"); ;
      dic.Add("0031003100360057", "日盛-鳳山");
      dic.Add("0031003100360069", "日盛-樹林");
      dic.Add("003100310036006a", "日盛-頭份");
      dic.Add("0031003100360067", "日盛-龍潭");
      dic.Add("0031003100360063", "日盛-豐原");
      break;

    case "6110": // 台中銀
      dic.Add("0036003100310041", "台中銀-豐原");
      dic.Add("6114", "台中銀-員林");
      dic.Add("6115", "台中銀-台北");
      dic.Add("6116", "台中銀-高雄");
      dic.Add("6110", "台中銀");
      break;

    case "8150": // 台新證券
      dic.Add("8150", "台新證券");
      dic.Add("8151", "台新-建北");
      dic.Add("8152", "台新-新莊");
      dic.Add("8153", "台新-松山(停)");
      dic.Add("8156", "台新-三民");
      dic.Add("8157", "台新-左楠");
      dic.Add("8158", "台新-松江");
      dic.Add("8159", "台新-台南");

      dic.Add("0038003100350053", "台新-中壢");
      dic.Add("0038003100350046", "台新-五權(停)");
      dic.Add("0038003100350042", "台新-台中");
      dic.Add("003800310035004b", "台新-前鎮(停)");
      dic.Add("0038003100350048", "台新-屏東");
      dic.Add("0038003100350041", "台新-高雄");
      dic.Add("003800310035005a", "台新-國際證券");
      dic.Add("003800310035004a", "台新-新板(停)");
      dic.Add("0038003100350059", "台新-新營");
      dic.Add("0038003100350055", "台新-鳳山(停)");
      break;

    case "1110"://台灣企銀
      dic.Add("0031003100310043", "台灣企銀-三民");
      dic.Add("0031003100310046", "台灣企銀-北高雄");
      dic.Add("0031003100310041", "台灣企銀-民雄");
      dic.Add("0031003100310042", "台灣企銀-建成");
      dic.Add("0031003100310044", "台灣企銀-台北(停)");
      dic.Add("0031003100310047", "台灣企銀-埔墘");
      dic.Add("0031003100310045", "台灣企銀-桃園");
      dic.Add("1111", "台灣企銀-台中");
      dic.Add("1112", "台灣企銀-台南");
      dic.Add("1113", "台灣企銀-九如");
      dic.Add("1114", "台灣企銀-嘉義");
      dic.Add("1115", "台灣企銀-太平");
      dic.Add("1116", "台灣企銀-屏東");
      dic.Add("1117", "台灣企銀-竹北");
      dic.Add("1118", "台灣企銀-豐原");
      dic.Add("1119", "台灣企銀-岡山");
      dic.Add("1110", "台灣企銀");
      break;

    case "6450": //永全
      dic.Add("6450", "永全證券");
      dic.Add("6452", "永全-八德");
      dic.Add("6451", "永全-南崁");
      break;

    case "5600": //永興
      dic.Add("5604", "永興-大墩");
      dic.Add("5602", "永興-水湳");
      dic.Add("5603", "永興-台中");
      dic.Add("5600", "永興");
      break;

    case "9A00": //永豐金
                 //dic.Add("9A00", "") ' 無此項
      dic.Add("0039004100300030", "永豐金證券");
      dic.Add("0039004100390056", "永豐金-三民(停)");
      dic.Add("003900410039004b", "永豐金-三重");
      dic.Add("0039004100390038", "永豐金-大園");
      dic.Add("0039004100390033", "永豐金-大稻埕(停)");
      dic.Add("0039004100390055", "永豐金-中正");
      dic.Add("0039004100390042", "永豐金-中和");
      dic.Add("0039004100390066", "永豐金-中盛");
      dic.Add("0039004100390039", "永豐金-中壢");
      dic.Add("0039004100360038", "永豐金-五權(停)");
      dic.Add("0039004100390067", "永豐金-內湖");
      dic.Add("0039004100390047", "永豐金-天母");
      dic.Add("0039004100390072", "永豐金-北高雄");
      dic.Add("0039004100390064", "永豐金-古亭");
      dic.Add("003900410039004c", "永豐金-台中");
      dic.Add("0039004100390068", "永豐金-台南");
      dic.Add("0039004100390057", "永豐金-市政");
      dic.Add("0039004100390063", "永豐金-永康");
      dic.Add("0039004100390076", "永豐金-光復(停)");
      dic.Add("0039004100390046", "永豐金-安和(停)");
      dic.Add("0039004100390050", "永豐金-竹北");
      dic.Add("0039004100390058", "永豐金-竹科");
      dic.Add("0039004100390070", "永豐金-府城(停)");
      dic.Add("0039004100390044", "永豐金-忠孝");
      dic.Add("0039004100390059", "永豐金-板盛");
      dic.Add("003900410039004a", "永豐金-板新");
      dic.Add("0039004100390045", "永豐金-板橋");
      dic.Add("0039004100390031", "永豐金-松山");
      dic.Add("0039004100390062", "永豐金-虎尾");
      dic.Add("0039004100390052", "永豐金-信義");
      dic.Add("003900410039004d", "永豐金-南投");
      dic.Add("0039004100390053", "永豐金-南京");
      dic.Add("0039004100360039", "永豐金-屏東");
      dic.Add("0039004100390061", "永豐金-苓雅");
      dic.Add("0039004100390043", "永豐金-員林");
      dic.Add("0039004100370039", "永豐金-埔里");
      dic.Add("003900410039006b", "永豐金-桃中(停)");
      dic.Add("003900410039004e", "永豐金-桃盛");
      dic.Add("0039004100390078", "永豐金-桃園");
      dic.Add("0039004100390065", "永豐金-高雄");
      dic.Add("0039004100380038", "永豐金-國際證券");
      dic.Add("0039004100390036", "永豐金-博愛");
      dic.Add("003900410039005a", "永豐金-復興");
      dic.Add("0039004100380039", "永豐金-敦北");
      dic.Add("0039004100380046", "永豐金-敦南");
      dic.Add("0039004100390037", "永豐金-新竹");
      dic.Add("0039004100390069", "永豐金-新店");
      dic.Add("0039004100390048", "永豐金-新莊");
      dic.Add("0039004100390032", "永豐金-萬盛");
      dic.Add("0039004100390035", "永豐金-經紀部");
      dic.Add("003900410039006a", "永豐金-嘉義");
      dic.Add("0039004100390073", "永豐金-彰化");
      dic.Add("0039004100360031", "永豐金-鳳山");
      dic.Add("0039004100370047", "永豐金-數位(停)");
      dic.Add("0039004100390071", "永豐金-潮州");
      dic.Add("0039004100390051", "永豐金-豐原");
      dic.Add("0039004100390041", "永豐金-羅東");
      break;

    case "8840": //玉山
      dic.Add("8840", "玉山證券");
      dic.Add("8841", "玉山-雙和");
      dic.Add("8842", "玉山-新莊");
      dic.Add("8843", "玉山-高雄");
      dic.Add("8844", "玉山-松江(停)");
      dic.Add("8845", "玉山-仁愛(停)");
      dic.Add("8846", "玉山-板橋");
      dic.Add("8847", "玉山-台南");
      dic.Add("8848", "玉山-嘉義");
      dic.Add("8849", "玉山-景美");
      dic.Add("0038003800340041", "玉山-士林");
      dic.Add("003800380034004a", "玉山-大里");
      dic.Add("0038003800340042", "玉山-台中");
      dic.Add("0038003800340044", "玉山-左營");
      dic.Add("0038003800340043", "玉山-南京東路");
      dic.Add("0038003800340045", "玉山-城中");
      dic.Add("0038003800340046", "玉山-桃園");
      dic.Add("003800380034004c", "玉山-國際證券");
      dic.Add("0038003800340048", "玉山-新竹");
      dic.Add("003800380034004d", "玉山-數位");
      break;

    case "6380":// 光和
      dic.Add("0036003300380044", "光和-高雄");
      dic.Add("0036003300380041", "光和-嘉義");
      dic.Add("6381", "光和-溪湖");
      dic.Add("6382", "光和-田中");
      dic.Add("6383", "光和-和美");
      dic.Add("6385", "光和-花壇");
      dic.Add("6386", "光和-虎尾");
      dic.Add("6380", "光和");
      break;

    case "1020": //合庫證券
      dic.Add("0031003000320047", "合庫-三重");
      dic.Add("0031003000320043", "合庫-自強");
      dic.Add("0031003000320046", "合庫-西台中");
      dic.Add("0031003000320045", "合庫-桃園");
      dic.Add("0031003000320051", "合庫-國際證券");
      dic.Add("0031003000320041", "合庫-新竹");
      dic.Add("1020", "合庫證券");
      dic.Add("1021", "合庫-台中");
      dic.Add("1022", "合庫-台南");
      dic.Add("1023", "合庫-高雄");
      dic.Add("1024", "合庫-嘉義");
      dic.Add("1025", "合庫-基隆");
      dic.Add("1028", "合庫-彰化");
      dic.Add("1029", "合庫-鳳山");
      break;

    case "8380"://安泰
      dic.Add("8381", "安泰-大發");
      dic.Add("8382", "安泰-楠梓");
      dic.Add("8380", "安泰");
      break;

    case "1260":// 宏遠證券
      dic.Add("1260", "宏遠證券");
      dic.Add("0031003200360048", "宏遠-中和");
      dic.Add("003100320036004c", "宏遠-台中");
      dic.Add("0031003200360044", "宏遠-台南");
      dic.Add("1261", "宏遠-民生");
      dic.Add("1264", "宏遠-南京(停)");
      dic.Add("1262", "宏遠-桃園");
      dic.Add("0031003200360051", "宏遠-高雄");
      dic.Add("0031003200360058", "宏遠-新化");
      dic.Add("0031003200360055", "宏遠-館前");
      dic.Add("0031003200360069", "宏遠-光隆");
      break;

    case "2180":// 亞東
      dic.Add("0032003100380041", "亞東-國際證券");
      dic.Add("2181", "亞東-板橋");
      dic.Add("2184", "亞東-新竹");
      dic.Add("2185", "亞東-台南");
      dic.Add("2186", "亞東-高雄");
      dic.Add("2187", "亞東-台中");
      dic.Add("2180", "亞東");
      break;

    case "5860":// 盈溢
      dic.Add("5862", "盈溢-楠梓");
      dic.Add("5861", "盈溢-籬子內");
      dic.Add("5860", "盈溢");
      break;

    case "7030":// 致和
      dic.Add("7030", "致和證券");
      dic.Add("7031", "致和-台北");
      dic.Add("7032", "致和-佳里");
      dic.Add("7033", "致和-府前");
      dic.Add("7034", "致和-金華");
      dic.Add("7035", "致和-東門");
      dic.Add("7036", "致和-高雄");
      dic.Add("7038", "致和-南京");
      dic.Add("0037003000330042", "致和-崇德");
      break;

    case "5320":// 高橋
      dic.Add("5322", "高橋-中壢");
      dic.Add("5323", "高橋-內壢");
      dic.Add("5321", "高橋-龍潭");
      dic.Add("5320", "高橋");
      break;

    case "8880":// 國泰證券
      dic.Add("0038003800380051", "國泰-國際證券");
      dic.Add("003800380038004b", "國泰-板橋");
      dic.Add("0038003800380041", "國泰-館前");
      dic.Add("8880", "國泰證券");
      dic.Add("8881", "國泰-高雄");
      dic.Add("8882", "國泰-台中");
      dic.Add("8883", "國泰-松江");
      dic.Add("8884", "國泰-台南");
      dic.Add("8885", "國泰-桃園");
      dic.Add("8886", "國泰-新莊");
      dic.Add("8887", "國泰-忠孝");
      dic.Add("8888", "國泰-敦南");
      break;

    case "8450":// 康和
      dic.Add("0038003400350046", "康和-仁愛");
      dic.Add("0038003400350041", "康和-內湖");
      dic.Add("0038003400350055", "康和-台北");
      dic.Add("0038003400350042", "康和-永和");
      dic.Add("0038003400350052", "康和-石牌");
      dic.Add("0038003400350044", "康和-板橋");
      dic.Add("0038003400350053", "康和-南崁");
      dic.Add("0038003400350058", "康和-屏東");
      dic.Add("003800340035004a", "康和-高雄");
      dic.Add("0038003400350059", "康和-國際證券");
      dic.Add("0038003400350045", "康和-澎湖");
      dic.Add("8451", "康和-延平");
      dic.Add("8455", "康和-台中");
      dic.Add("8456", "康和-新竹");
      dic.Add("8458", "康和-台南");
      dic.Add("8459", "康和-嘉義");
      dic.Add("8450", "康和");
      break;

    case "5380": // 第一金
      dic.Add("0035003300380046", "第一金-大稻埕");
      dic.Add("0035003300380047", "第一金-中和(停)");
      dic.Add("0035003300380059", "第一金-中壢");
      dic.Add("0035003300380043", "第一金-光復");
      dic.Add("003500330038006a", "第一金-安和");
      dic.Add("0035003300380045", "第一金-自由");
      dic.Add("0035003300380044", "第一金-忠孝");
      dic.Add("0035003300380061", "第一金-國際證券");
      dic.Add("0035003300380057", "第一金-華江");
      dic.Add("0035003300380042", "第一金-新竹");
      dic.Add("0035003300380041", "第一金-新興");
      dic.Add("003500330038004c", "第一金-經紀部");
      dic.Add("0035003300380050", "第一金-路竹");
      dic.Add("003500330038004d", "第一金-嘉義");
      dic.Add("0035003300380049", "第一金-頭份");
      dic.Add("003500330038004e", "第一金-豐原");
      dic.Add("0035003300380056", "第一金-灣內(停)");
      dic.Add("5381", "第一金-員林");
      dic.Add("5382", "第一金-台中");
      dic.Add("5383", "第一金-高雄");
      dic.Add("5384", "第一金-台南");
      dic.Add("5385", "第一金-桃園");
      dic.Add("5386", "第一金-彰化");
      dic.Add("5387", "第一金-澎湖");
      dic.Add("5389", "第一金-中山");
      dic.Add("5380", "第一金");
      break;


    case "5850":// 統一
      dic.Add("0035003800350051", "統一-三多");
      dic.Add("003500380035004a", "統一-三重");
      dic.Add("0035003800350059", "統一-土城");
      dic.Add("003500380035004d", "統一-士林");
      dic.Add("0035003800350063", "統一-仁愛");
      dic.Add("0035003800350062", "統一-內湖");
      dic.Add("0035003800350056", "統一-古亭(停)");
      dic.Add("0035003800350067", "統一-平鎮");
      dic.Add("0035003800350042", "統一-永和");
      dic.Add("0035003800350052", "統一-汐止");
      dic.Add("003500380035006d", "統一-竹南");
      dic.Add("0035003800350053", "統一-宜蘭");
      dic.Add("0035003800350050", "統一-板橋");
      dic.Add("003500380035005a", "統一-松江");
      dic.Add("0035003800350057", "統一-金門");
      dic.Add("0035003800350055", "統一-南京");
      dic.Add("0035003800350049", "統一-員林");
      dic.Add("0035003800350048", "統一-桃園");
      dic.Add("0035003800350073", "統一-國際證券");
      dic.Add("0035003800350041", "統一-基隆");
      dic.Add("0035003800350044", "統一-新台中");
      dic.Add("0035003800350064", "統一-新店(停)");
      dic.Add("0035003800350068", "統一-新桃園(停)");
      dic.Add("0035003800350065", "統一-新莊(停)");
      dic.Add("0035003800350045", "統一-新營");
      dic.Add("0035003800350046", "統一-彰化");
      dic.Add("003500380035004c", "統一-豐原(停)");
      dic.Add("5851", "統一-高雄");
      dic.Add("5852", "統一-敦南");
      dic.Add("5853", "統一-中壢");
      dic.Add("5854", "統一-城中");
      dic.Add("5855", "統一-台南");
      dic.Add("5856", "統一-台中");
      dic.Add("5857", "統一-新竹");
      dic.Add("5858", "統一-嘉義");
      dic.Add("5859", "統一-屏東");
      dic.Add("5850", "統一");
      break;

    case "7790":// 國票
      dic.Add("0037003700390062", "國票-國際證券");
      dic.Add("0037003700390063", "國票-敦北法人");
      dic.Add("003700370039004a", "國票-北高雄");
      dic.Add("0037003700390050", "國票-九鼎");
      dic.Add("0037003700390058", "國票-中和");
      dic.Add("003700370039006d", "國票-中港");
      dic.Add("0037003700390056", "國票-天祥");
      dic.Add("0037003700390076", "國票-台中");
      dic.Add("0037003700390044", "國票-台南");
      dic.Add("003700370039005a", "國票-安和");
      dic.Add("003700370039006a", "國票-和平");
      dic.Add("0037003700390075", "國票-長城");
      dic.Add("003700370039006e", "國票-南京");
      dic.Add("0037003700390065", "國票-南科");
      dic.Add("0037003700390045", "國票-南崁");
      dic.Add("0037003700390072", "國票-桃園");
      dic.Add("003700370039007a", "國票-博愛");
      dic.Add("0037003700390047", "國票-新莊");
      dic.Add("0037003700390048", "國票-嘉義");
      dic.Add("0037003700390057", "國票-彰化");
      dic.Add("7790", "國票證券");
      dic.Add("7791", "國票-台東");
      dic.Add("7792", "國票-北投");
      dic.Add("7795", "國票-南港");
      dic.Add("7797", "國票-中正");
      dic.Add("7798", "國票-內壢");
      break;

    case "9200": // 凱基
      dic.Add("003900320031004d", "凱基-八德");
      dic.Add("0039003200310045", "凱基-三峽");
      dic.Add("003900320031004a", "凱基-土城");
      dic.Add("0039003200300057", "凱基-大里");
      dic.Add("0039003200310047", "凱基-五股");
      dic.Add("0039003200310046", "凱基-天母");
      dic.Add("003900320030005a", "凱基-台東");
      dic.Add("0039003200300044", "凱基-市府");
      dic.Add("0039003200310043", "凱基-民權");
      dic.Add("003900320030004d", "凱基-宜蘭");
      dic.Add("0039003200310053", "凱基-幸福");
      dic.Add("0039003200300045", "凱基-東門");
      dic.Add("0039003200310059", "凱基-東勢");
      dic.Add("0039003200300041", "凱基-板橋");
      dic.Add("0039003200310048", "凱基-南京(停)");
      dic.Add("0039003200320043", "凱基-屏東");
      dic.Add("0039003200300046", "凱基-站前");
      dic.Add("0039003200300048", "凱基-基隆");
      dic.Add("0039003200320048", "凱基-復興");
      dic.Add("003900320030004e", "凱基-湖口");
      dic.Add("0039003200300056", "凱基-新店");
      dic.Add("0039003200300047", "凱基-彰化");
      dic.Add("0039003200300043", "凱基-雙和");
      dic.Add("9202", "凱基-中港");
      dic.Add("9203", "凱基-總公司");
      dic.Add("9204", "凱基-台中");
      dic.Add("9205", "凱基-三重");
      dic.Add("9206", "凱基-高雄");
      dic.Add("9209", "凱基-岡山");
      dic.Add("9207", "凱基-永和");
      dic.Add("9208", "凱基-桃園");
      dic.Add("9211", "凱基-台南");
      dic.Add("9212", "凱基-東港");
      dic.Add("9215", "凱基-高美館");
      dic.Add("9216", "凱基-信義");
      dic.Add("9217", "凱基-松山");
      dic.Add("9218", "凱基-大直");
      dic.Add("9223", "凱基-豐中");
      dic.Add("9224", "凱基-新莊");
      dic.Add("9225", "凱基-內埔");
      dic.Add("9226", "凱基-汐止");
      dic.Add("9227", "凱基-城中");
      dic.Add("9229", "凱基-中山");
      dic.Add("9231", "凱基-員林");
      dic.Add("9232", "凱基-建成(停)");
      dic.Add("9233", "凱基-長庚");
      dic.Add("9234", "凱基-竹北");
      dic.Add("9235", "凱基-永華");
      dic.Add("9236", "凱基-虎尾");
      dic.Add("9237", "凱基-敦北");
      dic.Add("9238", "凱基-士林");
      dic.Add("9239", "凱基-市政");
      dic.Add("9243", "凱基-七賢(停)");
      dic.Add("9252", "凱基-嘉義");
      dic.Add("9254", "凱基-科園");
      dic.Add("9255", "凱基-和平");
      dic.Add("9256", "凱基-南崁");
      dic.Add("9257", "凱基-林口");
      dic.Add("9258", "凱基-羅東");
      dic.Add("9259", "凱基-澄新(停)");
      dic.Add("9265", "凱基-平鎮(停)");
      dic.Add("9266", "凱基-新豐");
      dic.Add("9268", "凱基-台北");
      dic.Add("9269", "凱基-永春(停)");
      dic.Add("9272", "凱基-竹科");
      dic.Add("9273", "凱基-竹東");
      dic.Add("9274", "凱基-鳳山");
      dic.Add("9275", "凱基-三多");
      dic.Add("9276", "凱基-苗栗");
      dic.Add("9278", "凱基-永康");
      dic.Add("9281", "凱基-斗六");
      dic.Add("9283", "凱基-北門");
      dic.Add("9285", "凱基-中壢");
      dic.Add("9287", "凱基-內湖");
      dic.Add("9288", "凱基-埔墘");
      dic.Add("9289", "凱基-興隆");
      dic.Add("9291", "凱基-大安");
      dic.Add("9294", "凱基-西屯(停)");
      dic.Add("9296", "凱基-頭份");
      dic.Add("9297", "凱基-文心");
      dic.Add("9298", "凱基-延平(停)");
      dic.Add("9299", "凱基-國際證券");
      dic.Add("9200", "凱基");
      break;

    case "9600":// 富邦證券
      dic.Add("003900360031004b", "富邦-七賢");
      dic.Add("0039003600320042", "富邦-二林");
      dic.Add("0039003600330041", "富邦-八德");
      dic.Add("003900360032004a", "富邦-三峽");
      dic.Add("0039003600320059", "富邦-土城(停)");
      dic.Add("003900360031004c", "富邦-士林");
      dic.Add("0039003600310058", "富邦-大墩");
      dic.Add("003900360032004b", "富邦-中和");
      dic.Add("0039003600310046", "富邦-中港");
      dic.Add("0039003600320058", "富邦-文化");
      dic.Add("0039003600320047", "富邦-斗六");
      dic.Add("003900360031004d", "富邦-木柵");
      dic.Add("0039003600330042", "富邦-北宜蘭(停)");
      dic.Add("0039003600320046", "富邦-北桃園(停)");
      dic.Add("0039003600320051", "富邦-北高雄");
      dic.Add("003900360031005a", "富邦-永康");
      dic.Add("0039003600310047", "富邦-成功(停)");
      dic.Add("003900360031004e", "富邦-西壢");
      dic.Add("0039003600310050", "富邦-和美");
      dic.Add("0039003600310045", "富邦-府城(停)");
      dic.Add("0039003600310044", "富邦-忠孝");
      dic.Add("0039003600310057", "富邦-東花蓮(停)");
      dic.Add("0039003600320043", "富邦-東門");
      dic.Add("0039003600310056", "富邦-板橋中山");
      dic.Add("0039003600320041", "富邦-信義");
      dic.Add("0039003600310043", "富邦-南京");
      dic.Add("0039003600310052", "富邦-南員林");
      dic.Add("0039003600310059", "富邦-屏東");
      dic.Add("0039003600310051", "富邦-重新(停)");
      dic.Add("0039003600320056", "富邦-復興(停)");
      dic.Add("0039003600310053", "富邦-景美(停)");
      dic.Add("0039003600320052", "富邦-園區");
      dic.Add("0039003600310048", "富邦-新板");
      dic.Add("0039003600320044", "富邦-新莊");
      dic.Add("0039003600320048", "富邦-鳳山(停)");
      dic.Add("0039003600320045", "富邦-樹林");
      dic.Add("0039003600320055", "富邦-縣政(停)");
      dic.Add("003900360031004a", "富邦-興業(停)");
      dic.Add("0039003600320050", "富邦-頭份");
      dic.Add("0039003600320057", "富邦-龍潭(停)");
      dic.Add("003900360033004c", "富邦-豐原");
      dic.Add("003900360032004c", "富邦-雙和");
      dic.Add("9600", "富邦證券");
      dic.Add("9671", "富邦-八德(停)");
      dic.Add("9677", "富邦-三重");
      dic.Add("9618", "富邦-大同(停)");
      dic.Add("9636", "富邦-中壢");
      dic.Add("9676", "富邦-仁愛");
      dic.Add("9627", "富邦-內湖");
      dic.Add("9664", "富邦-天母(停)");
      dic.Add("9615", "富邦-木柵(停)");
      dic.Add("9652", "富邦-世貿(停)");
      dic.Add("9678", "富邦-北投(停)");
      dic.Add("9623", "富邦-台北");
      dic.Add("9608", "富邦-台東");
      dic.Add("9667", "富邦-台南");
      dic.Add("9688", "富邦-市政(停)");
      dic.Add("9651", "富邦-民生");
      dic.Add("9695", "富邦-民雄");
      dic.Add("9654", "富邦-永和");
      dic.Add("9624", "富邦-竹北");
      dic.Add("9625", "富邦-竹東");
      dic.Add("9686", "富邦-宜蘭");
      dic.Add("9616", "富邦-岡山");
      dic.Add("9679", "富邦-延吉");
      dic.Add("9655", "富邦-板橋");
      dic.Add("9621", "富邦-花蓮");
      dic.Add("9697", "富邦-虎尾");
      dic.Add("9666", "富邦-南屯");
      dic.Add("9658", "富邦-建國");
      dic.Add("9657", "富邦-苗栗");
      dic.Add("9689", "富邦-重慶(停)");
      dic.Add("9672", "富邦-員林");
      dic.Add("9665", "富邦-桃園");
      dic.Add("9659", "富邦-高雄");
      dic.Add("9614", "富邦-基隆");
      dic.Add("9663", "富邦-敦南");
      dic.Add("9604", "富邦-陽明");
      dic.Add("9622", "富邦-園區"); // (停) ，"富邦-園區" 上面有1個重覆
      dic.Add("9647", "富邦-新竹");
      dic.Add("9661", "富邦-新店");
      dic.Add("9693", "富邦-新營");
      dic.Add("9602", "富邦-溪湖(停)");
      dic.Add("9699", "富邦-經紀");
      dic.Add("9692", "富邦-嘉義");
      dic.Add("9634", "富邦-羅東");
      dic.Add("0039003600390043", "富邦-北港");
      dic.Add("003900360035004b", "富邦-台中");
      dic.Add("0039003600360046", "富邦-左營");
      dic.Add("0039003600300053", "富邦-國際證券");
      dic.Add("0039003600350055", "富邦-彰化");
      break;

    case "5110":// 富隆
      dic.Add("5112", "富隆-長安");
      dic.Add("5110", "富隆");
      break;

    case "9300":// 華南永昌
      dic.Add("9302", "華南永昌-台中");
      dic.Add("9303", "華南永昌-高雄");
      dic.Add("9305", "華南永昌-新莊");
      dic.Add("9306", "華南永昌-台南");
      dic.Add("9307", "華南永昌-大安");
      dic.Add("9308", "華南永昌-麻豆");
      dic.Add("9309", "華南永昌-古亭");
      dic.Add("9312", "華南永昌-民權");
      dic.Add("9314", "華南永昌-嘉義");
      dic.Add("9315", "華南永昌-大甲");
      dic.Add("9316", "華南永昌-淡水");
      dic.Add("9317", "華南永昌-林口");
      dic.Add("9319", "華南永昌-鶯歌");
      dic.Add("9322", "華南永昌-公誠");
      dic.Add("9323", "華南永昌-小港");
      dic.Add("9324", "華南永昌-岡山");
      dic.Add("9325", "華南永昌-忠孝");
      dic.Add("9326", "華南永昌-南京");
      dic.Add("9327", "華南永昌-斗六");
      dic.Add("9328", "華南永昌-潮州");
      dic.Add("9329", "華南永昌-朴子");
      dic.Add("9331", "華南永昌-鳳山");
      dic.Add("9332", "華南永昌-楠梓");
      dic.Add("9333", "華南永昌-長虹");
      dic.Add("9334", "華南永昌-世貿");
      dic.Add("9337", "華南永昌-內壢");
      dic.Add("9339", "華南永昌-竹北");
      dic.Add("9343", "華南永昌-頭份");
      dic.Add("9347", "華南永昌-敦南");
      dic.Add("9349", "華南永昌-板橋");
      dic.Add("9352", "華南永昌-桃園");
      dic.Add("9358", "華南永昌-東勢");
      dic.Add("9359", "華南永昌-中正");
      dic.Add("9362", "華南永昌-苗栗");
      dic.Add("9363", "華南永昌-彰化");
      dic.Add("9364", "華南永昌-和平(停)");
      dic.Add("9366", "華南永昌-豐原");
      dic.Add("9369", "華南永昌-三重");
      dic.Add("9377", "華南永昌-虎尾");
      dic.Add("9381", "華南永昌-斗南(停)");
      dic.Add("9382", "華南永昌-北港(停)");
      dic.Add("9386", "華南永昌-東昇");
      dic.Add("9399", "華南永昌-國際證券");
      dic.Add("9300", "華南永昌");
      break;

    case "8710":// 陽信
      dic.Add("8711", "陽信-石牌");
      dic.Add("8713", "陽信-高雄");
      dic.Add("8710", "陽信");
      break;

    case "8560":// 新光
      dic.Add("8561", "新光-台中");
      dic.Add("8564", "新光-台南");
      dic.Add("8565", "新光-桃園");
      dic.Add("8562", "新光-高雄");
      dic.Add("8563", "新光-新竹");
      dic.Add("8560", "新光");
      break;

    case "8490":// 京城(原：萬泰)
      dic.Add("8492", "京城-嘉義");
      dic.Add("8490", "京城");
      break;

    case "9100":// 群益金鼎
      dic.Add("003900310033004e", "群益金鼎-土城");
      dic.Add("0039003100380067", "群益金鼎-大甲");
      dic.Add("0039003100380065", "群益金鼎-大安");
      dic.Add("0039003100300044", "群益金鼎-市府");
      dic.Add("0039003100380048", "群益金鼎-中山");
      dic.Add("0039003100380041", "群益金鼎-中壢");
      dic.Add("0039003100380073", "群益金鼎-丹鳳");
      dic.Add("0039003100380064", "群益金鼎-內湖");
      dic.Add("0039003100380050", "群益金鼎-天母");
      dic.Add("0039003100330052", "群益金鼎-北高雄");
      dic.Add("0039003100380043", "群益金鼎-古亭");
      dic.Add("0039003100380058", "群益金鼎-台北");
      dic.Add("003900310038004a", "群益金鼎-永和");
      dic.Add("0039003100380069", "群益金鼎-竹南");
      dic.Add("003900310038007a", "群益金鼎-宜蘭");
      dic.Add("0039003100380078", "群益金鼎-延平");
      dic.Add("0039003100380057", "群益金鼎-忠孝");
      dic.Add("0039003100380044", "群益金鼎-東門");
      dic.Add("003900310038004b", "群益金鼎-東湖");
      dic.Add("0039003100380042", "群益金鼎-板橋");
      dic.Add("0039003100330043", "群益金鼎-信義(停)");
      dic.Add("0039003100330067", "群益金鼎-三重");
      dic.Add("0039003100380045", "群益金鼎-南京");
      dic.Add("0039003100330048", "群益金鼎-屏東");
      dic.Add("003900310038004c", "群益金鼎-建成");
      dic.Add("0039003100330045", "群益金鼎-基隆");
      dic.Add("0039003100330055", "群益金鼎-崇德");
      dic.Add("0039003100380046", "群益金鼎-新店");
      dic.Add("0039003100380047", "群益金鼎-新莊");
      dic.Add("0039003100380075", "群益金鼎-瑞豐");
      dic.Add("0039003100330049", "群益金鼎-萬華");
      dic.Add("003900310038004d", "群益金鼎-嘉義");
      dic.Add("0039003100380063", "群益金鼎-鳳山");
      dic.Add("0039003100330044", "群益金鼎-潭子");
      dic.Add("0039003100330059", "群益金鼎-館前");
      dic.Add("9101", "群益金鼎-敦南");
      dic.Add("9103", "群益金鼎-松山");
      dic.Add("9105", "群益金鼎-高盛");
      dic.Add("9108", "群益金鼎-海山");
      dic.Add("9131", "群益金鼎-民權");
      dic.Add("9134", "群益金鼎-開元");
      dic.Add("9135", "群益金鼎-東大");
      dic.Add("9136", "群益金鼎-西松");
      dic.Add("9137", "群益金鼎-士林");
      dic.Add("9138", "群益金鼎-中港");
      dic.Add("9182", "群益金鼎-總公司");
      dic.Add("9183", "群益金鼎-高雄");
      dic.Add("9184", "群益金鼎-台中");
      dic.Add("9185", "群益金鼎-台南");
      dic.Add("9186", "群益金鼎-新竹");
      dic.Add("9187", "群益金鼎-彰化");
      dic.Add("9188", "群益金鼎-三民");
      dic.Add("9189", "群益金鼎-桃園");
      dic.Add("9199", "群益金鼎-國際證券");
      dic.Add("9100", "群益金鼎");
      break;

    case "1230": //彰銀
      dic.Add("1232", "彰銀-七賢");
      dic.Add("1233", "彰銀-台中");
      dic.Add("1230", "彰銀");
      break;

    case "6480":// 福邦證券
      dic.Add("6480", "福邦證券");
      dic.Add("6489", "福邦-新竹");
      break;

    case "1040":// 臺銀
      dic.Add("0031003000340044", "臺銀-金山");
      dic.Add("0031003000340043", "臺銀-高雄");
      dic.Add("0031003000340041", "臺銀-臺中");
      dic.Add("1041", "臺銀-鳳山");
      dic.Add("1042", "臺銀-臺南");
      dic.Add("1043", "臺銀-民權");
      dic.Add("1045", "臺銀-新竹");
      dic.Add("1040", "臺銀");
      break;

    case "6910":// 德信
      dic.Add("6911", "德信-台北(停)");
      dic.Add("6912", "德信-中正");
      dic.Add("6913", "德信-新營");
      dic.Add("6914", "德信-三重");
      dic.Add("6915", "德信-和平");
      dic.Add("6910", "德信");
      break;

    case "8580":// 聯邦商銀
      dic.Add("8580", "聯邦商銀");
      dic.Add("8581", "聯邦-高雄");
      dic.Add("8582", "聯邦-嘉義");
      dic.Add("8583", "聯邦-忠孝");
      dic.Add("8584", "聯邦-雙和");
      dic.Add("8585", "聯邦-三重");
      dic.Add("8586", "聯邦-大業");
      dic.Add("8587", "聯邦-興中");
      dic.Add("8588", "聯邦-富強");
      break;

    case "7000":// 兆豐
      dic.Add("0037003000300068", "兆豐-三民");
      dic.Add("0037003000300053", "兆豐-大同");
      dic.Add("003700300030006a", "兆豐-大安");
      dic.Add("0037003000300052", "兆豐-小港");
      dic.Add("0037003000300062", "兆豐-中壢");
      dic.Add("0037003000300071", "兆豐-內湖");
      dic.Add("003700300030004a", "兆豐-公益");
      dic.Add("003700300030004c", "兆豐-天母");
      dic.Add("0037003000300045", "兆豐-斗南");
      dic.Add("0037003000300049", "兆豐-北高雄");
      dic.Add("0037003000300063", "兆豐-民生");
      dic.Add("0037003000300058", "兆豐-永和");
      dic.Add("0037003000300044", "兆豐-西螺");
      dic.Add("0037003000300043", "兆豐-來福");
      dic.Add("0037003000300073", "兆豐-岡山");
      dic.Add("0037003000300061", "兆豐-忠孝");
      dic.Add("0037003000300048", "兆豐-東門");
      dic.Add("0037003000300042", "兆豐-板橋");
      dic.Add("0037003000300069", "兆豐-松德");
      dic.Add("0037003000300046", "兆豐-虎尾");
      dic.Add("0037003000300050", "兆豐-南京");
      dic.Add("0037003000300067", "兆豐-南門");
      dic.Add("0037003000300057", "兆豐-城中");
      dic.Add("003700300030006b", "兆豐-員林");
      dic.Add("003700300030004e", "兆豐-埔墘");
      dic.Add("003700300030004d", "兆豐-桃園");
      dic.Add("0037003000300055", "兆豐-桃鶯");
      dic.Add("003700300030005a", "兆豐-高雄");
      dic.Add("003700300030006d", "兆豐-國際證券");
      dic.Add("0037003000300066", "兆豐-鹿港");
      dic.Add("0037003000300047", "兆豐-麻豆");
      dic.Add("0037003000300070", "兆豐-復興");
      dic.Add("0037003000300056", "兆豐-新竹");
      dic.Add("0037003000300077", "兆豐-新莊");
      dic.Add("003700300030004b", "兆豐-新營");
      dic.Add("0037003000300064", "兆豐-彰化");
      dic.Add("0037003000300072", "兆豐-寶成");
      dic.Add("7005", "兆豐-台中港");
      dic.Add("7001", "兆豐-嘉義");
      dic.Add("7003", "兆豐-台中");
      dic.Add("7006", "兆豐-台南");
      dic.Add("7007", "兆豐-竹北");
      dic.Add("7008", "兆豐-三重");
      dic.Add("7009", "兆豐-景美");
      dic.Add("7000", "兆豐證券");
      break;

    //---------------------------------------------------
    //單1列。外資
    case "1360": dic.Add("1360", "港商麥格理"); break;// (外資)
    case "1380": dic.Add("1380", "台灣匯立證券"); break; // (外資)
    case "1400": dic.Add("1400", "港商蘇皇"); break;
    case "1440": dic.Add("1440", "美林"); break; // (外資)
    case "1470": dic.Add("1470", "台灣摩根士丹利"); break; // (外資)
    case "1480": dic.Add("1480", "美商高盛"); break; // (外資)
    case "1520": dic.Add("1520", "瑞士信貸"); break; // (外資)
    case "1530": dic.Add("1530", "港商德意志(停)"); break; //
    case "1560": dic.Add("1560", "港商野村"); break; // (外資)
    case "1570": dic.Add("1570", "港商法國興業"); break; // (外資)
    case "1590": dic.Add("1590", "花旗環球"); break; // (外資)
    case "1650": dic.Add("1650", "新加坡商瑞銀"); break; // (外資)
    case "1660": dic.Add("1660", "港商聯昌"); break; //

    case "6640": dic.Add("6640", "渣打商銀"); break; //
    case "8440": dic.Add("8440", "摩根大通"); break; // (外資)
    case "8700": dic.Add("8700", "花旗"); break; // (外資)
    case "8890": dic.Add("8890", "大和國泰"); break; // (日)外資
    case "8900": dic.Add("8900", "法銀巴黎"); break; // (外資)
    case "8910": dic.Add("8910", "台灣巴克萊"); break; // (外資)
    case "8960": dic.Add("8960", "香港上海匯豐"); break; // (外資)
                                                   //---------------------------------------------------
                                                   // 單1列。順序，中文字數 多=>少，因要處理(消去)字串
    case "1090": dic.Add("1090", "台灣工銀"); break;
    case "2200": dic.Add("2200", "元大期貨"); break;
    case "2210": dic.Add("2210", "群益期貨"); break;
    case "6620": dic.Add("6620", "口袋證券"); break;
    case "7080": dic.Add("7080", "石橋證券"); break;
    case "7750": dic.Add("7750", "北城證券"); break;
    case "3000": dic.Add("3000", "台新銀"); break;
    case "6210": dic.Add("6210", "新百王"); break;

    case "5460": dic.Add("5460", "寶盛"); break;
    case "5500": dic.Add("5500", "豐銀"); break;
    case "5660": dic.Add("5660", "日進"); break;
    case "5690": dic.Add("5690", "豐興"); break;
    case "5870": dic.Add("5870", "光隆"); break;
    case "6660": dic.Add("6660", "和興"); break;
    case "6950": dic.Add("6950", "福勝"); break;
    case "7070": dic.Add("7070", "豐農"); break;
    case "7120": dic.Add("7120", "台安"); break;
    case "7530": dic.Add("7530", "富順"); break;
    case "7690": dic.Add("7690", "金興"); break;
    case "7900": dic.Add("7900", "豐德"); break;
    case "8520": dic.Add("8520", "中農"); break;
    case "8660": dic.Add("8660", "萬通"); break;
    case "8690": dic.Add("8690", "新壽"); break;
    case "8770": dic.Add("8770", "大鼎"); break;
    }

    return dic;

  }
}
